examples/OpenFOAM/3d_pipe/scalar_transport/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
75000
(
(1.22576e-06 8.54325e-08 0.000196354)
(3.22618e-09 2.47217e-08 0.000199132)
(3.96235e-09 1.09097e-08 0.000194532)
(6.87167e-10 1.24141e-08 0.000192929)
(-3.092e-11 1.13624e-08 0.00019247)
(-4.07066e-11 1.06812e-08 0.000192138)
(-6.65894e-11 1.03091e-08 0.000191803)
(-1.29624e-10 9.80037e-09 0.000191519)
...
)
;

boundaryField
{
    inlet
    {
        type            codedFixedValue;
        value           nonuniform List<vector> 
1500
(
(0 0 0.000459995)
(0 0 0.000868942)
(0 0 0.00135852)
(0 0 0.00194456)
(0 0 0.00264542)
(0 0 0.00348309)
(0 0 0.00448352)
(0 0 0.00567705)
...
)
;
        name            parabolicVelocity;
        code            #{
              const vectorField& Cf = patch().Cf();
              vectorField& field = *this;
              
              const scalar c = 0;
              const scalar r = 1;
              const scalar Umax = 0.1;
              
              forAll(Cf, faceI)
              {
                  const scalar x = Cf[faceI][0];
                  const scalar y = Cf[faceI][1];
                  
                  field[faceI] = vector(0,0,Umax*(1-((pow((y-c)/r,2))+(pow((x-c)/r,2)))));
              }
        #};
    }
    wall
    {
        type            noSlip;
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
